DataProcessors/Уведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Уведомления</Name>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ТипУведомления</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыЗанятия</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Запланировано</Name>
    </Value>
    <Value>
      <Name>Подтверждено</Name>
    </Value>
    <Value>
      <Name>Проведено</Name>
    </Value>
    <Value>
      <Name>Отменено</Name>
    </Value>
    <Value>
      <Name>Перенесено</Name>
    </Value>
    <Value>
      <Name>НеСостоялось</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыАбонементаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыАбонементаКлиента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Активен</Name>
    </Value>
    <Value>
      <Name>Заморожен</Name>
    </Value>
    <Value>
      <Name>Закончился</Name>
    </Value>
    <Value>
      <Name>Истёк</Name>
    </Value>
    <Value>
      <Name>Отменён</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/Занятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Занятие</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДатаЗанятия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Аудитория</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Направление</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ТипЗанятия</Name>
      <ValueType><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <TabularSection>
      <Name>Участники</Name>
      <Attributes>
        <Attribute>
          <Name>Клиент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Абонемент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>СтатусПосещения</Name>
          <ValueType><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Стоимость</Name>
          <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Комментарий</Name>
          <ValueType><v8:Type>xs:string</v8:Type></ValueType>
        </Attribute>
      </Attributes>
    </TabularSection>

  </ChildObjects>
</MetaDataObject>

Catalogs/АбонементыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АбонементыКлиента</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВидАбонемента</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Абонементы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Абонементы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПокупки</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачалаДействия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Использовано</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Заморожено</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>10</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ПроданоПоДокументу</Name>
      <ValueType><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

DataProcessors/Уведомления/Ext/ObjectModule.bsl
// Обработка Отправка уведомлений клиентам
// - напоминание за 24 часа и за 2 часа
// - уведомление об отмене/переносе
// - о низком остатке и окончании абонемента

Процедура ОтправитьНапоминания(Команда)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Занятия.Участники.Клиент КАК Клиент,
		|	Занятия.Дата КАК Дата,
		|	Занятия.ВремяНачала КАК ВремяНачала
		|ИЗ
		|	Документ.Занятие КАК Занятия
		|ГДЕ
		|	Занятия.ВремяНачала МЕЖДУ &От И &До
		|	И Занятия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Подтверждено)";
	Запрос.УстановитьПараметр("От", ТекущаяДата() + 23 * 3600);
	Запрос.УстановитьПараметр("До", ТекущаяДата() + 25 * 3600);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Текст = "Напоминание: занятие " + Формат(Выборка.Дата, "ДЛФ=DD") + " в " + Формат(Выборка.ВремяНачала, "ДФ=HH:mm");
		УведомленияСервер.ОтправитьУведомление(Выборка.Клиент, "Напоминание24часа", Текст);
	КонецЦикла;
КонецПроцедуры

Процедура УведомитьОкончаниеАбонементов(Команда)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АбонементыКлиента.Клиент КАК Клиент,
		|	АбонементыКлиента.ВидАбонемента КАК ВидАбонемента,
		|	АбонементыКлиента.КоличествоЗанятий - АбонементыКлиента.Использовано КАК Остаток
		|ИЗ
		|	Справочник.АбонементыКлиента КАК АбонементыКлиента
		|ГДЕ
		|	АбонементыКлиента.ДатаОкончания <= &Граница
		|	И АбонементыКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАбонементаКлиента.Активен)";
	Запрос.УстановитьПараметр("Граница", ТекущаяДата() + 7 * 86400);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Текст = "Ваш абонемент заканчивается. Остаток занятий: " + Выборка.Остаток;
		УведомленияСервер.ОтправитьУведомление(Выборка.Клиент, "ОкончаниеАбонемента", Текст);
	КонецЦикла;
КонецПроцедуры
